# Development tools
brew "oven-sh/bun/bun"
brew "tmux"
brew "neovim"
brew "go"
brew "rustup"
brew "fnm"
brew "uv"
brew "kubectl"
brew "helm"
brew "fzf"
brew "gh"

# Rust CLI utilities
brew "delta"
brew "fd"
brew "eza"
brew "dust"
brew "procs"

# Coding assistants
brew "gemini-cli"
brew "anomalyco/tap/opencode"
brew "terminal-notifier"

# Mac App Store CLI
brew "mas"

# Casks - Desktop apps
cask "hammerspoon"
cask "karabiner-elements"
cask "codex-app"
cask "codex"
cask "claude-code"
cask "visual-studio-code"
cask "wezterm"
cask "iterm2"
cask "ghostty"
cask "orbstack"
cask "fork"
cask "telegram"
cask "discord"
cask "welly"
cask "raycast"
cask "slack"
cask "obsidian"
cask "google-chrome"
cask "cleanshot"
cask "popclip"
cask "chatgpt"
cask "claude"

# Fonts
cask "font-fira-code-nerd-font"
cask "font-jetbrains-mono-nerd-font"
cask "font-hack-nerd-font"
cask "font-maple-mono-normal-nf-cn"

# Mac App Store apps
mas "LINE", id: 539883307
mas "Dropover", id: 1355679052
mas "Bob", id: 1630034110 
